#Словари
my_dict = {'Дмитрий': 1993, 'Константин': 1996, 'Артем': 2023}
print('Словарь:', my_dict)
print('Существующая величина:', my_dict.get('Дмитрий'))
print('Несуществующая величина:', my_dict.get('Елизар', 'Такого имени нет'))
print('Удаленная величина:', my_dict.pop('Константин'))
my_dict.update({'Елена': 1995,
                'Яна': 1996})
print('Обновленный словарь:', my_dict)

# Множества
my_set = {1, 1, 3, 3, 9, 5, True, False, 5.9, True, 'String'}
print('Моё множество:', my_set)
my_set.update([4, 8])
print('Измененное множество:', my_set)


